In [1]:
# https://leetcode.com/problems/get-the-size-of-a-dataframe/description/?envType=study-plan-v2&envId=introduction-to-pandas&lang=pythondata
import pandas as pd
from typing import List

In [49]:
def createDataframe(student_data: List[List[int]]) -> pd.DataFrame:
    columns = ("student_id", "name", "age" )  # using tuples will increase performance 
    df = pd.DataFrame(student_data, columns=columns)
    return df
    return list(df.shape) # will return size of datafram
#     return student_data.head(3)

In [50]:
data = {
    'student_id': [101, 53, 128, 3],
    'name': ['Ulysses', 'William', 'Henry', 'Henry'],
    'age': [13, 10, 6, 11]
}
df=createDataframe(data)

In [72]:
df.loc[df['student_id']==101, ["name", "age"]]

      name  age
0  Ulysses   13

In [75]:
df['bonus'] = df['age'] *2

In [76]:
df

   student_id     name  age  bonus
0         101  Ulysses   13     26
1          53  William   10     20
2         128    Henry    6     12
3           3    Henry   11     22